import cls from './Offer.module.scss';

const Offer = () => {
    return (
        <div className={cls.offer}>
            <div>
                <p className={cls.title}>1. ОБЩИЕ ПОЛОЖЕНИЯ:</p>
                <p>
                    1.1. Индивидуальный предприниматель Кочегаров Алексей Юрьевич далее «Продавец», публикует настоящую
                    Публичную оферту на предоставление доступа к чат-боту на платформе мессенджера Телеграм (Telegram).
                </p>
                <p>
                    1.2. В соответствии со статьей 437 Гражданского Кодекса Российской Федерации (далее - ГК РФ) данный
                    документ является публичной офертой, и в случае принятия изложенных ниже условий физическое лицо,
                    производящее акцепт этой оферты, осуществляет оплату услуги Продавца в соответствии с условиями
                    настоящего Договора. В соответствии с пунктом 3 статьи 438 ГК РФ, оплата услуги Покупателем является
                    акцептом оферты, что считается равносильным заключению Договора на условиях, изложенных в оферте.
                </p>
                <p>
                    1.3. Оферта, а также вся информация об Услугах Исполнителя: стоимость, виды и сроки оказания Услуг
                    опубликованы в Telegram-боте Исполнителя.
                </p>
                <p>
                    1.4. На основании вышеизложенного внимательно ознакомьтесь с текстом публичной оферты, и, если Вы не
                    согласны с каким-либо пунктом оферты, Вам предлагается отказаться от использования услуг,
                    предоставляемых Продавцом.
                </p>
            </div>
            <div>
                <p className={cls.title}>2. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ</p>
                <p>
                    2.1. «Оферта» – настоящее предложение, содержащее все существенные условия договора, из которого
                    усматривается воля Исполнителя на заключение договора на указанных в настоящем предложении условиях
                    с любым лицом, кто отзовётся.
                </p>
                <p>2.2. «Telegram-бот Исполнителя» – Telegram-бот, расположенный по адресу: https://t.me/shpisarbot</p>
                <p>
                    2.3. «Акцепт Оферты» – совершение Заказчиком действий, указанных в настоящей Оферте,
                    свидетельствующих о принятии данным лицом условий Оферты в полном объеме, в том числе, совершении
                    действий по выполнению указанных в настоящей Оферте условий.
                </p>
                <p>
                    2.4. «Заказчик» – совершеннолетнее дееспособное физическое лицо, индивидуальный предприниматель или
                    юридическое лицо, заключивший Договор с Исполнителем в электронной форме в результате Акцепта Оферты
                    и, тем самым, получивший право получать Услуги Исполнителя, и в полном объеме выполняющий свои
                    обязательства по Договору.
                </p>
                <p>
                    2.5. «Договор» – означает настоящий Договор-оферту на оказание Услуг, выбранных Заказчиком на
                    Telegram-боте Исполнителя, заключенный между Исполнителем и Заказчиком в результате Акцепта
                    Заказчиком Оферты, наделяющий Исполнителя и Заказчика правами и обязанностями, указанными в
                    настоящей Оферте. Любая ссылка в настоящей Оферте на Договор (статью Договора) и/или его условия
                    означает соответствующую ссылку на настоящую Оферту и/или ее условия.
                </p>
                <p>2.6. «Стороны» – именуемые совместно стороны Договора – Исполнитель и Заказчик.</p>
                <p>
                    2.7. «Услуга» / «Услуги» – деятельность Исполнителя, связанная с оказанием услуг по распознаванию
                    речи и преобразованию ее в текст из аудиоматериалов Заказчика, а также предоставление доступа к
                    отдельным разделам в Телеграм-боте.
                </p>
                <p>2.8. Условия выбранных Заказчиком Услуг становятся частью Договора.</p>
            </div>
            <div>
                <p className={cls.title}>3. ПРЕДМЕТ ДОГОВОРА</p>
                <p>3.1. Исполнитель обязуется оказывать Заказчику выбранные им Услуги.</p>
                <p>
                    3.2. Заказчик обязуется оплачивать Услуги на условиях и в порядке, определенных настоящим Договором.
                </p>
                <p>
                    3.3. Услуги оказываются только в отношении Telegram-аккаунта Заказчика, с которого был совершен
                    Акцепт Оферты.
                </p>
            </div>
            <div>
                <p className={cls.title}>4. ПОРЯДОК ЗАКЛЮЧЕНИЯ ДОГОВОРА. СПОСОБЫ ОПЛАТЫ УСЛУГ</p>
                <p>
                    4.1. Надлежащим безоговорочным Акцептом настоящей Оферты в соответствии со статьей 438 Гражданского
                    кодекса Российской Федерации является оплата Заказчиком Услуг Исполнителя на условиях 100%
                    предоплаты.
                </p>
                <p>
                    4.2. Стоимость Услуг и способы оплаты Услуг Заказчиком, описание предоставляемых Исполнителем
                    дополнительных возможностей для оплаты и получения Услуг публикуются в Telegram-боте Исполнителя.
                    Оплачивая Услуги, Заказчик выражает полное и безоговорочное согласие с действующими на момент оплаты
                    условиями Оферты, частью которых являются условия оказания Услуг.
                </p>
            </div>
            <div>
                <p className={cls.title}>5. ПРАВА И ОБЯЗАННОСТИ СТОРОН</p>
                <p>5.1. Заказчик обязуется:</p>
                <p>5.1.1. полностью оплатить Услуги в порядке 100%-ной предварительной оплаты до начала их оказания;</p>
                <p>
                    5.1.2. сообщать Исполнителю сведения (в том числе, персональные данные), необходимые Исполнителю для
                    предоставления Заказчику Услуг и исполнения других своих обязательств, установленных Договором и
                    действующим законодательством РФ;
                </p>
                <p>
                    5.1.3. самостоятельно следить за любыми обновлениями информации, размещаемой в Telegram-боте
                    Исполнителя, в том числе, следить за изменениями условий оказания Услуг, изменениями настоящего
                    Договора и любых иных материалов, которые прямо или косвенно связаны с оказанием Услуги или влияют
                    на них. Заказчик лишается права ссылаться на отсутствие осведомленности об указанных изменениях,
                    если такие изменения размещены в Telegram-боте Исполнителя;
                </p>
                <p>
                    5.1.4. не воспроизводить (копировать), не распространять, не доводить до всеобщего сведения, а также
                    любым иным образом не использовать любые результаты интеллектуальной деятельности, которые
                    становятся доступны Заказчику в процессе или в результате оказания Услуг.
                </p>
                <p>5.2. Заказчик имеет право получать заказанную Услугу при условии ее предварительной оплаты.</p>
                <p>
                    5.3. Исполнитель обязуется организовать и оказать выбранную Заказчиком Услугу качественно и с учетом
                    описания Услуги, которая выбрана Заказчиком.
                </p>
                <p>5.4. Исполнитель имеет право:</p>
                <p>
                    5.4.1. не допускать к получению Услуг лиц, чьи данные, представленные при заключении Договора не
                    совпадают с данными лиц, претендующих на оказание Услуг непосредственно перед началом оказания
                    Услуг;
                </p>
                <p>
                    5.4.2. самостоятельно избирать форму оказания Услуг с учетом условий оказания Услуг, выбранных
                    Заказчиком;
                </p>
                <p>
                    5.4.3. в любое время полностью или частично изменять описание Услуг, с учетом предварительного
                    уведомления Заказчика; такие изменения и дополнения вступают в силу немедленно после
                    соответствующего уведомления, которое может быть направлено Заказчику в любой форме, включая, но, не
                    ограничиваясь, размещением соответствующего уведомления в Telegram-боте Исполнителя и/или либо иным
                    образом.
                </p>
            </div>
            <div>
                <p className={cls.title}>6. КОНФИДЕНЦИАЛЬНОСТЬ И ПЕРСОНАЛЬНЫЕ ДАННЫЕ</p>
                <p>
                    6.1. Заказчик в соответствии с Федеральным законом от 27.07.2006 № 152-ФЗ «О персональных данных» в
                    результате Акцепта Оферты дает Исполнителю согласие на сбор, хранение и обработку, в том числе,
                    автоматизированную, информации, относящейся к персональным данным (далее «Персональные данные»)
                    Заказчика либо третьего лица, в интересах которого Заказчик заключает договор.
                </p>
                <p>
                    6.2. Заказчик заверяет и гарантирует, что им получено прямое предварительное согласие субъектов
                    персональных данных на их передачу Исполнителю, в той мере, в какой оно необходимо в силу
                    применимого законодательства, форма и содержание такого согласия соответствует требованиям
                    законодательства Российской Федерации, в том числе Федерального закона от 27.07.2006 № 152-ФЗ «О
                    персональных данных», Федерального закона от 13.03.2006 № 38-ФЗ «О рекламе», а также гарантирует,
                    что сбор, хранение и использование Заказчиком, персональных данных физических лиц осуществляется
                    исключительно с согласия таких физических лиц.
                </p>
                <p>6.3. Исполнитель не обрабатывает и не хранит персональные данные переданные ему Заказчиком.</p>
            </div>
            <div>
                <p className={cls.title}>7. ПОРЯДОК РАССМОТРЕНИЯ ПРЕТЕНЗИЙ И СПОРОВ</p>
                <p>
                    7.1. Претензия Заказчика по неисполнению и/или ненадлежащему исполнению Исполнителем своих
                    обязательств по Договору предъявляется в электронной письменной форме и подлежит регистрации в день
                    ее получения Исполнителем. К претензии прилагаются необходимые для рассмотрения претензии документы,
                    в которых должны быть указаны сведения о неисполнении или ненадлежащем исполнении обязательств
                    Исполнителя по Договору.
                </p>
                <p>
                    7.2. В случае если претензия была признана Исполнителем обоснованной, выявленные недостатки подлежат
                    устранению. Отказ в удовлетворении претензии должен быть аргументирован. Заказчику могут быть
                    предложены варианты:
                </p>
                <p>7.2.1. получить Услугу в другое время;</p>
                <p>7.2.2. получить другую Услугу, равнозначную по цене;</p>
                <p>7.2.3. получить скидку на Услуги;</p>
                <p>7.2.4. возврат денег, уплаченных в виде предварительной оплаты Услуг.</p>
                <p>
                    7.3. Все споры, связанные прямо или косвенно с Офертой и Договором, заключенным в результате Акцепта
                    Оферты, стороны решают путем переговоров. Если решение спора путем переговоров не удается достичь,
                    все споры подлежат рассмотрению в суде по месту нахождения Исполнителя. Соблюдение претензионного
                    порядка разрешения спора Заказчиком до обращения в суд является обязательным.
                </p>
            </div>
            <div>
                <p className={cls.title}>8. СРОК ДЕЙСТВИЯ ДОГОВОРА. ПОРЯДОК ИЗМЕНЕНИЯ И РАСТОРЖЕНИЯ</p>
                <p>
                    8.1. Договор вступает в силу с момента Акцепта настоящей Оферты в порядке, установленном п. 4.1
                    Договора, и действует в течение срока оказания Услуг в части обязательств по оказанию Услуг и в
                    течение иных сроков, если такие сроки указаны в Оферте (например, в отношении согласия на обработку
                    персональных данных), либо до момента его расторжения по основаниям, предусмотренным настоящим
                    Договором, в том числе, в случае отсутствия технической возможности оказания Услуг.
                </p>
                <p>
                    8.2. Заказчик вправе расторгнуть Договор в одностороннем порядке, направив Исполнителю письменное
                    заявление о расторжении не позднее, чем за 7 (Семь) дней до начала оказания Услуг.
                </p>
            </div>
            <div>
                <p className={cls.title}>9. ПРОЧИЕ УСЛОВИЯ</p>
                <p>
                    9.1. Все претензии в адрес Исполнителя должны направляться Заказчиком электронным письмом в
                    письменной форме по адресу s@bolshoyrazgovor.ru, если иной порядок их направления специально не
                    предусмотрен условиями Договора.
                </p>
                <p>
                    9.2. Все иные сообщения и предложения, а равно любые иные документы, связанные с настоящим
                    Договором, за исключением указанных в п. 8.1. настоящей Оферты, могут направляться по почтовым и
                    электронным адресам Сторон, и являются надлежащими, если позволяют идентифицировать отправившее лицо
                    (например, содержат имя, адрес электронной почты, контактные данные такого лица).
                </p>
                <p>
                    9.3. Стороны условились применять к подписанию документов, составляющих содержание электронной
                    переписки, правила о простой электронной подписи, рассматривая в качестве такой простой электронной
                    подписи адреса почтовых ящиков, указанные в реквизитах Исполнителя, и содержащиеся в данных о
                    Заказчике, указанных в заказе Услуги, приравнивая такие простые электронные подписи к аналогу
                    собственноручной подписи Сторон, а документы в электронной форме – к аналогам документов на бумажном
                    носителе. Стороны обязуются сохранять в конфиденциальности ключи своих электронных подписей.
                </p>
            </div>
            <div>
                <p className={cls.title}>10. РЕКВИЗИТЫ ИСПОЛНИТЕЛЯ</p>
                <p>Индивидуальный предприниматель Кочегаров Алексей Юрьевич</p>
                <p>ИНН 272109587729</p>
                <p>ОГРНИП 321272400007868</p>
                <p>Юридический адрес организации</p>
                <p>680017, Россия, Хабаровский край, г.Хабаровск, ул.Ленина, д.70, кв.4,</p>
                <p>Банк: АО "ТИНЬКОФФ БАНК"</p>
                <p>Расчётный счёт: 40802810200002467473</p>
                <p>Корреспондентский счёт: 30101810145250000974</p>
                <p>БИК: 044525974</p>
            </div>
        </div>
    );
};

export default Offer;
